Repository: DianaZayats/internet-technologies_group_pr
Catalog: WebAppCore/Resources/ValidationMessages.*.resx
Languages: cs_cz, uk_ua

# FullName_Required
source: The 'Full Name' field is required
cs_cz: Pole 'Celé jméno' je povinné
uk_ua: Поле 'Повне ім'я' є обов'язковим для заповнення

# FullName_StringLength
source: The 'Full Name' field must contain between {2} and {1} characters
cs_cz: Pole 'Celé jméno' musí obsahovat mezi {2} a {1} znaky
uk_ua: Поле 'Повне ім'я' повинно містити від {2} до {1} символів

# Email_Required
source: The 'Email' field is required
cs_cz: Pole 'Email' je povinné
uk_ua: Поле 'Email' є обов'язковим для заповнення

# Email_EmailAddress
source: Please enter a valid email address
cs_cz: Zadejte platnou e-mailovou adresu
uk_ua: Введіть коректну адресу електронної пошти

# Age_Required
source: The 'Age' field is required
cs_cz: Pole 'Věk' je povinné
uk_ua: Поле 'Вік' є обов'язковим для заповнення

# Age_Range
source: Age must be between {1} and {2} years
cs_cz: Věk musí být mezi {1} a {2} lety
uk_ua: Вік повинен бути від {1} до {2} років

# Password_Required
source: The 'Password' field is required
cs_cz: Pole 'Heslo' je povinné
uk_ua: Поле 'Пароль' є обов'язковим для заповнення

# Password_StringLength
source: Password must contain between {2} and {1} characters
cs_cz: Heslo musí obsahovat mezi {2} a {1} znaky
uk_ua: Пароль повинен містити від {2} до {1} символів

# ConfirmPassword_Required
source: The 'Confirm Password' field is required
cs_cz: Pole 'Potvrzení hesla' je povinné
uk_ua: Поле 'Підтвердження пароля' є обов'язковим для заповнення

# ConfirmPassword_Compare
source: Password and password confirmation do not match
cs_cz: Heslo a potvrzení hesla se neshodují
uk_ua: Пароль та підтвердження пароля не співпадають

# OrderAmount_Required
source: The 'Order Amount' field is required
cs_cz: Pole 'Částka objednávky' je povinné
uk_ua: Поле 'Сума замовлення' є обов'язковим для заповнення

# OrderAmount_Range
source: Order amount must be between {1} and {2}
cs_cz: Částka objednávky musí být mezi {1} a {2}
uk_ua: Сума замовлення повинна бути від {1} до {2}

# PromoCode_Remote
source: Promo code is invalid for this order amount
cs_cz: Propagační kód není platný pro tuto částku objednávky
uk_ua: Промокод недійсний для цієї суми замовлення

# RecipeName_Required
source: The 'Recipe Name' field is required
cs_cz: Pole 'Název receptu' je povinné
uk_ua: Поле 'Назва рецепту' є обов'язковим для заповнення

# RecipeName_StringLength
source: The 'Recipe Name' field must contain between {2} and {1} characters
cs_cz: Pole 'Název receptu' musí obsahovat mezi {2} a {1} znaky
uk_ua: Поле 'Назва рецепту' повинно містити від {2} до {1} символів

# Description_Required
source: The 'Description' field is required
cs_cz: Pole 'Popis receptu' je povinné
uk_ua: Поле 'Опис рецепту' є обов'язковим для заповнення

# Description_StringLength
source: The 'Description' field must contain between {2} and {1} characters
cs_cz: Pole 'Popis receptu' musí obsahovat mezi {2} a {1} znaky
uk_ua: Поле 'Опис рецепту' повинно містити від {2} до {1} символів

# Category_Required
source: The 'Category' field is required
cs_cz: Pole 'Kategorie' je povinné
uk_ua: Поле 'Категорія' є обов'язковим для заповнення

# Difficulty_Required
source: The 'Difficulty' field is required
cs_cz: Pole 'Obtížnost' je povinné
uk_ua: Поле 'Складність' є обов'язковим для заповнення

# CookingTime_Required
source: The 'Cooking Time' field is required
cs_cz: Pole 'Doba přípravy' je povinné
uk_ua: Поле 'Час приготування' є обов'язковим для заповнення

# CookingTime_Range
source: Cooking time must be between {1} and {2} minutes
cs_cz: Doba přípravy musí být mezi {1} a {2} minutami
uk_ua: Час приготування повинен бути від {1} до {2} хвилин

# CookingTime_Remote
source: Cooking time does not match the recipe difficulty
cs_cz: Doba přípravy neodpovídá obtížnosti receptu
uk_ua: Час приготування не відповідає складності рецепту

# Ingredients_Required
source: The 'Ingredients' field is required
cs_cz: Pole 'Ingredience' je povinné
uk_ua: Поле 'Інгредієнти' є обов'язковим для заповнення

# Ingredients_StringLength
source: The 'Ingredients' field must contain between {2} and {1} characters
cs_cz: Pole 'Ingredience' musí obsahovat mezi {2} a {1} znaky
uk_ua: Поле 'Інгредієнти' повинно містити від {2} до {1} символів
