Repository: DianaZayats/internet-technologies_group_pr
Catalog: WebAppCore/Resources/Views/Recipe/Index.*.resx
Languages: cs_cz

# RecipeIndex_Title
source: Рецепти
cs_cz: Recepty

# RecipeIndex_AddRecipe
source: Додати рецепт
cs_cz: Přidat recept

# RecipeIndex_Category
source: Категорія
cs_cz: Kategorie

# RecipeIndex_AllCategories
source: Всі категорії
cs_cz: Všechny kategorie

# Category_Breakfast
source: Сніданок
cs_cz: Snídaně

# Category_Lunch
source: Обід
cs_cz: Oběd

# Category_Dinner
source: Вечеря
cs_cz: Večeře

# Category_Dessert
source: Десерт
cs_cz: Dezert

# Category_Snack
source: Закуска
cs_cz: Svačina

# RecipeIndex_Difficulty
source: Складність
cs_cz: Obtížnost

# RecipeIndex_AllDifficulties
source: Вся складність
cs_cz: Všechny obtížnosti

# Difficulty_Easy
source: Простий
cs_cz: Snadné

# Difficulty_Medium
source: Середній
cs_cz: Střední

# Difficulty_Hard
source: Складний
cs_cz: Těžké

# RecipeIndex_MinTime
source: Мін. час (хв)
cs_cz: Min. čas (min)

# RecipeIndex_MaxTime
source: Макс. час (хв)
cs_cz: Max. čas (min)

# RecipeIndex_Search
source: Пошук
cs_cz: Vyhledávání

# RecipeIndex_SearchPlaceholder
source: Назва або опис...
cs_cz: Název nebo popis...

# RecipeIndex_SearchButton
source: Шукати
cs_cz: Hledat

# RecipeIndex_Reset
source: Скинути
cs_cz: Resetovat

# RecipeIndex_Minutes
source: хв
cs_cz: min

# RecipeIndex_ViewDetails
source: Деталі рецепту
cs_cz: Detaily receptu

# RecipeIndex_NoRecipes
source: Рецептів не знайдено
cs_cz: Recepty nenalezeny

# RecipeIndex_NoRecipesMessage
source: Спробуйте змінити фільтри або створити новий рецепт.
cs_cz: Zkuste změnit filtry nebo vytvořit nový recept.

# RecipeIndex_AddFavorite
source: Додати до улюблених
cs_cz: Přidat do oblíbených

# RecipeIndex_RemoveFavorite
source: Видалити з улюблених
cs_cz: Odebrat z oblíbených

# RecipeCreate_Title
source: Додати рецепт
cs_cz: Přidat recept

# RecipeCreate_Subtitle
source: Заповніть форму для додавання нового рецепту
cs_cz: Vyplňte formulář pro přidání nového receptu

# RecipeCreate_SelectCategory
source: Оберіть категорію
cs_cz: Vyberte kategorii

# RecipeCreate_SelectDifficulty
source: Оберіть складність
cs_cz: Vyberte obtížnost

# RecipeCreate_SelectDiet
source: Оберіть тип дієти
cs_cz: Vyberte typ diety

# RecipeCreate_SelectCuisine
source: Оберіть кухню
cs_cz: Vyberte kuchyni

# RecipeCreate_SelectBudget
source: Оберіть бюджет
cs_cz: Vyberte rozpočet

# RecipeCreate_IngredientsPlaceholder
source: Введіть список інгредієнтів, розділених комами або новими рядками
cs_cz: Zadejte seznam ingrediencí oddělených čárkami nebo novými řádky

# RecipeCreate_IngredientsHint
source: Формат: кількість одиниця назва (наприклад: 2 стакани борошна)
cs_cz: Formát: množství jednotka název (např.: 2 šálky mouky)

# RecipeCreate_Submit
source: Додати рецепт
cs_cz: Přidat recept

# RecipeCreate_Cancel
source: Скасувати
cs_cz: Zrušit

# RecipeIndex_Edit
source: Edit
cs_cz: Upravit

# RecipeIndex_Delete
source: Delete
cs_cz: Smazat

# RecipeIndex_BackToList
source: Back to list
cs_cz: Zpět na seznam

# RecipeIndex_DeleteConfirm
source: Are you sure you want to delete this recipe?
cs_cz: Opravdu chcete smazat tento recept?

# RecipeEdit_Title
source: Edit Recipe
cs_cz: Upravit recept

# RecipeEdit_Subtitle
source: Edit recipe information
cs_cz: Upravit informace o receptu

# RecipeEdit_Submit
source: Update Recipe
cs_cz: Aktualizovat recept

# RecipeEdit_Cancel
source: Cancel
cs_cz: Zrušit
